  
  var mulvin = [ "", "পারাজিকপাল়ি", "পাচিত্তিযপাল়ি", "মহাৰগ্গপাল়ি", "চূল়ৰগ্গপাল়ি", "পরিৰারপাল়ি"  ]
  var mulsutta = ['']
  var muldig = [ "", "সীলক্খন্ধৰগ্গপাল়ি", "মহাৰগ্গপাল়ি", "পাথিকৰগ্গপাল়ি" ]
  var mulmaj = [ "", "মূলপণ্ণাসপাল়ি", "মজ্ঝিমপণ্ণাসপাল়ি", "উপরিপণ্ণাসপাল়ি" ]
  var mulsam = [ "", "সগাথাৰগ্গপাল়ি", "নিদানৰগ্গপাল়ি", "খন্ধৰগ্গপাল়ি", "সল়াযতনৰগ্গপাল়ি", "মহাৰগ্গপাল়ি" ]
  var mulang = [ "", "এককনিপাতপাল়ি", "দুকনিপাতপাল়ি", "তিকনিপাতপাল়ি", "চতুক্কনিপাতপাল়ি", "পঞ্চকনিপাতপাল়ি", "ছক্কনিপাতপাল়ি", "সত্তকনিপাতপাল়ি", "অট্ঠকাদিনিপাতপাল়ি", "নৰকনিপাতপাল়ি", "দসকনিপাতপাল়ি", "একাদসকনিপাতপাল়ি" ]
  var mulkhu = [ "", "খুদ্দকপাঠপাল়ি", "ধম্মপদপাল়ি", "উদানপাল়ি", "ইতিৰুত্তকপাল়ি", "সুত্তনিপাতপাল়ি", "ৰিমানৰত্থুপাল়ি", "পেতৰত্থুপাল়ি", "থেরগাথাপাল়ি", "থেরীগাথাপাল়ি", "অপদানপাল়ি-১", "অপদানপাল়ি-২", "বুদ্ধৰংসপাল়ি", "চরিযাপিটকপাল়ি", "জাতকপাল়ি-১", "জাতকপাল়ি-২", "মহানিদ্দেসপাল়ি", "চূল়নিদ্দেসপাল়ি", "পটিসম্ভিদামগ্গপাল়ি", "নেত্তিপ্পকরণপাল়ি", "মিলিন্দপঞ্হপাল়ি", "পেটকোপদেসপাল়ি" ]
  var mulabh = [ "", "ধম্মসঙ্গণীপাল়ি", "ৰিভঙ্গপাল়ি", "ধাতুকথাপাল়ি", "পুগ্গলপঞ্ঞত্তিপাল়ি", "কথাৰত্থুপাল়ি", "যমকপাল়ি-১", "যমকপাল়ি-২", "যমকপাল়ি-৩", "পট্ঠানপাল়ি-১", "পট্ঠানপাল়ি-২", "পট্ঠানপাল়ি-৩", "পট্ঠানপাল়ি-৪", "পট্ঠানপাল়ি-৫" ]
  var attvin = [ "", "পারাজিককণ্ড-অট্ঠকথা", "পাচিত্তিয-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা", "চূল়ৰগ্গ-অট্ঠকথা", "পরিৰার-অট্ঠকথা" ]
  var attasutta = ['']
  var attdig = [ "", "সীলক্খন্ধৰগ্গ-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা", "পাথিকৰগ্গ-অট্ঠকথা" ]
  var attmaj = [ "", "মূলপণ্ণাস-অট্ঠকথা", "মজ্ঝিমপণ্ণাস-অট্ঠকথা", "উপরিপণ্ণাস-অট্ঠকথা" ]
  var attsam = [ "", "সগাথাৰগ্গ-অট্ঠকথা", "নিদানৰগ্গ-অট্ঠকথা", "খন্ধৰগ্গ-অট্ঠকথা", "সল়াযতনৰগ্গ-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা" ]
  var attang = [ "", "এককনিপাত-অট্ঠকথা", "দুকনিপাত-অট্ঠকথা", "তিকনিপাত-অট্ঠকথা", "চতুক্কনিপাত-অট্ঠকথা", "পঞ্চকনিপাত-অট্ঠকথা", "ছক্কনিপাত-অট্ঠকথা", "সত্তকনিপাত-অট্ঠকথা", "অট্ঠকনিপাত-অট্ঠকথা", "নৰকনিপাত-অট্ঠকথা", "দসকনিপাত-অট্ঠকথা", "একাদসকনিপাত-অট্ঠকথা" ]
  var attkhu = [ "", "খুদ্দকপাঠ-অট্ঠকথা", "ধম্মপদ-অট্ঠকথা", "উদান-অট্ঠকথা", "ইতিৰুত্তক-অট্ঠকথা", "সুত্তনিপাত-অট্ঠকথা", "ৰিমানৰত্থু-অট্ঠকথা", "পেতৰত্থু-অট্ঠকথা", "থেরগাথা-অট্ঠকথা-১", "থেরগাথা-অট্ঠকথা-২", "থেরীগাথা-অট্ঠকথা", "অপদান-অট্ঠকথা", "বুদ্ধৰংস-অট্ঠকথা", "চরিযাপিটক-অট্ঠকথা", "জাতক-অট্ঠকথা-১", "জাতক-অট্ঠকথা-২", "জাতক-অট্ঠকথা-৩", "জাতক-অট্ঠকথা-৪", "জাতক-অট্ঠকথা-৫", "জাতক-অট্ঠকথা-৬", "জাতক-অট্ঠকথা-৭", "মহানিদ্দেস-অট্ঠকথা", "চূল়নিদ্দেস-অট্ঠকথা", "পটিসম্ভিদামগ্গ-অট্ঠকথা", "নেত্তিপ্পকরণ-অট্ঠকথা" ]
  var attabh = [ "", "ধম্মসঙ্গণি-অট্ঠকথা", "ৰিভঙ্গ-অট্ঠকথা", "ধাতুকথা-অট্ঠকথা", "পুগ্গলপঞ্ঞত্তি-অট্ঠকথা", "কথাৰত্থু-অট্ঠকথা", "যমকপ্পকরণ-অট্ঠকথা", "পট্ঠানপ্পকরণ-অট্ঠকথা" ]
  var tikvin = [ "", "সারত্থদীপনী-টীকা-১", "সারত্থদীপনী-টীকা-২", "সারত্থদীপনী-টীকা-৩", "দ্বেমাতিকাপাল়ি", "ৰিনযসঙ্গহ-অট্ঠকথা", "ৰজিরবুদ্ধি-টীকা", "ৰিমতিৰিনোদনী-টীকা", "ৰিনযালঙ্কার-টীকা", "কঙ্খাৰিতরণীপুরাণ-টীকা", "ৰিনযৰিনিচ্ছয-উত্তরৰিনিচ্ছয", "ৰিনযৰিনিচ্ছয-টীকা", "পাচিত্যাদিযোজনাপাল়ি", "খুদ্দসিক্খা-মূলসিক্খা" ]
  var tikasutta = ['']
  var tikdig = [ "", "সীলক্খন্ধৰগ্গ-টীকা", "মহাৰগ্গ-টীকা", "পাথিকৰগ্গ-টীকা", "সীলক্খন্ধৰগ্গ-অভিনৰটীকা-১", "সীলক্খন্ধৰগ্গ-অভিনৰটীকা-২" ]
  var tikmaj = [ "", "মূলপণ্ণাস-টীকা", "মজ্ঝিমপণ্ণাস-টীকা", "উপরিপণ্ণাস-টীকা" ]
  var tiksam = [ "", "সগাথাৰগ্গ-টীকা", "নিদানৰগ্গ-টীকা", "খন্ধৰগ্গ-টীকা", "সল়াযতনৰগ্গ-টীকা", "মহাৰগ্গ-টীকা" ]
  var tikang = [ "", "এককনিপাত-টীকা", "দুক-তিক-চতুক্কনিপাত-টীকা", "পঞ্চক-ছক্ক-সত্তকনিপাত-টীকা", "অট্ঠকাদিনিপাত-টীকা" ]
  var tikkhu = [ "", "নেত্তিপ্পকরণ-টীকা", "নেত্তিৰিভাৰিনী" ]
  var tikabh = [ "", "ধম্মসঙ্গণি-মূলটীকা", "ৰিভঙ্গ-মূলটীকা", "ধাতুকথা-মূলটীকা", "পুগ্গলপঞ্ঞত্তি-মূলটীকা", "কথাৰত্থু-মূলটীকা", "যমকপ্পকরণ-মূলটীকা", "পট্ঠানপ্পকরণ-মূলটীকা", "ধম্মসঙ্গণী-অনুটীকা", "পঞ্চপকরণ-অনুটীকা", "অভিধম্মাৰতারো-নামরূপপরিচ্ছেদো", "অভিধম্মত্থসঙ্গহো", "অভিধম্মাৰতার-পুরাণটীকা", "অভিধম্মমাতিকাপাল়ি" ]
  var annvisuddhimagga = [ "", "ৰিসুদ্ধিমগ্গ-১", "ৰিসুদ্ধিমগ্গ-২", "ৰিসুদ্ধিমগ্গ-মহাটীকা-১", "ৰিসুদ্ধিমগ্গ-মহাটীকা-২", "ৰিসুদ্ধিমগ্গ নিদানকথা" ]
  var annsangayana = [ "", "দীঘনিকায (পু-ৰি)", "মজ্ঝিমনিকায (পু-ৰি)", "সংযুত্তনিকায (পু-ৰি)", "অঙ্গুত্তরনিকায (পু-ৰি)", "ৰিনযপিটক (পু-ৰি)", "অভিধম্মপিটক (পু-ৰি)", "অট্ঠকথা (পু-ৰি)" ]
  var annledisayadaw = [ "", "নিরুত্তিদীপনী", "পরমত্থদীপনী সঙ্গহমহাটীকাপাঠ", "অনুদীপনীপাঠ", "পট্ঠানুদ্দেস দীপনীপাঠ" ]
  var annbuddhavandana = [ "", "নমক্কারটীকা", "মহাপণামপাঠ", "লক্খণাতো বুদ্ধথোমনাগাথা", "সুতৰন্দনা", "কমলাঞ্জলি", "জিনালঙ্কার", "পজ্জমধু", "বুদ্ধগুণগাথাৰলী" ]
  var annvangsagantha = [ "", "চূল়গন্থৰংস", "মহাৰংস", "সাসনৰংস" ]
  var annbyakarana = [ "", "কচ্চাযনব্যাকরণং", "মোগ্গল্লানব্যাকরণং", "সদ্দনীতিপ্পকরণং (পদমালা)", "সদ্দনীতিপ্পকরণং (ধাতুমালা)", "পদরূপসিদ্ধি", "মোগল্লানপঞ্চিকা", "পযোগসিদ্ধিপাঠ", "ৰুত্তোদযপাঠ", "অভিধানপ্পদীপিকাপাঠ", "অভিধানপ্পদীপিকাটীকা", "সুবোধালঙ্কারপাঠ", "সুবোধালঙ্কারটীকা", "বালাৰতার গণ্ঠিপদত্থৰিনিচ্ছযসার" ]
  var annniti = [ "", "লোকনীতি", "সুত্তন্তনীতি", "সূরস্সতিনীতি", "মহারহনীতি", "ধম্মনীতি", "কৰিদপ্পণনীতি", "নীতিমঞ্জরী", "নরদক্খদীপনী", "চতুরারক্খদীপনী", "চাণক্যনীতি" ]
  var annpakinnaka = [ "", "রসৰাহিনী", "সীমৰিসোধনীপাঠ", "ৰেস্সন্তরগীতি" ]
  var annsihala = [ "", "মোগ্গল্লান ৰুত্তিৰিৰরণপঞ্চিকা", "থূপৰংস", "দাঠাৰংস", "ধাতুপাঠৰিলাসিনিযা", "ধাতুৰংস", "হত্থৰনগল্লৰিহারৰংস", "জিনচরিতয", "জিনৰংসদীপং", "তেলকটাহগাথা", "মিলিদটীকা", "পদমঞ্জরী", "পদসাধনং", "সদ্দবিন্দুপকরণং", "কচ্চাযনধাতুমঞ্জুসা", "সামন্তকূটৰণ্ণনা" ]

var output = ''
function palibooks(idName, arr, classname){
  for(var i = 0; i < arr.length; i++){
     output += `<li id='mulavin' class='${classname} ${"index" + i}' onclick="openbook(event, '${idName + i}')"> ${arr[i]} </li>`
  }
}

palibooks('mulavi', mulvin, 'mulvi')
palibooks('', mulsutta , '')
palibooks('muladn', muldig , 'mulsu')
palibooks('mulamn', mulmaj, 'mulsu')
palibooks('mulasn', mulsam, 'mulsu')
palibooks('mulaan', mulang, 'mulsu')
palibooks('mulakn', mulkhu, 'mulsu')
palibooks('mulaabhi', mulabh, 'mulabhi')

palibooks('atatvi', attvin, 'attvi')
palibooks('', attasutta , '')
palibooks('attaadn', attdig, 'attsu')
palibooks('attaamn', attmaj, 'attsu')
palibooks('attaasn', attsam, 'attsu')
palibooks('attaan', attang, 'attsu')
palibooks('attakn', attkhu, 'attsu')
palibooks('attaabhi', attabh, 'attabhi')

palibooks('tikavi', tikvin, 'tilvi')
palibooks('', tikasutta , '')
palibooks('tikadn', tikdig, 'tiksu')
palibooks('tikamn', tikmaj, 'tiksu')
palibooks('tikasn', tiksam, 'tiksu')
palibooks('tikaan', tikang, 'tiksu')
palibooks('tikakn', tikkhu, 'tiksu')
palibooks('tikaabhi', tikabh, 'tikabhi')

palibooks('annovisu', annvisuddhimagga, 'annvisu')
palibooks('annosanga', annsangayana, 'annsanga')
palibooks('annoledisay', annledisayadaw, 'annledisay')
palibooks('annobuddhava', annbuddhavandana, 'annbuddhava')
palibooks('annovangsa', annvangsagantha, 'annvangsa')
palibooks('annobyakar', annbyakarana, 'annbyakar')
palibooks('annoniti', annniti, 'annniti')
palibooks('annopakinnaka', annpakinnaka, 'annpakinnaka')
palibooks('annosihala', annsihala, 'annsihala')

//console.log(output)

var palibooks = document.getElementById('palibooks')
var banglabooks = document.getElementById('banglabooks')
var englishbooks = document.getElementById('englishbooks')
palibooks.innerHTML = output
// banglabooks.innerHTML = output
// englishbooks.innerHTML = output
console.log(output)

var pitaka = ["ৰিনযপিটক", "সুত্তপিটক", "দীঘনিকায", "মজ্ঝিমনিকায", "সংযুত্তনিকায", "অঙ্গুত্তরনিকায", "খুদ্দকনিকায", "অভিধম্মপিটক", "ৰিনযপিটক (অট্ঠকথা)", "সুত্তপিটক (অট্ঠকথা)", "দীঘ নিকায (অট্ঠকথা)", "মজ্ঝিমনিকায (অট্ঠকথা)", "সংযুত্তনিকায (অট্ঠকথা)", "অঙ্গুত্তরনিকায (অট্ঠকথা)", "খুদ্দকনিকায (অট্ঠকথা)", "অভিধম্মপিটক (অট্ঠকথা)", "ৰিনযপিটক (টীকা)", "সুত্তপিটক (টীকা)", "দীঘনিকায (টীকা)", "মজ্ঝিমনিকায (টীকা)", "সংযুত্তনিকায (টীকা)", "অঙ্গুত্তরনিকায (টীকা)", "খুদ্দকনিকায (টীকা)", "অভিধম্মপিটক (টীকা)", "ৰিসুদ্ধিমগ্গ", "সঙ্গাযন-পুচ্ছ ৰিস্সজ্জনা", "লেডী সযাডো গন্থ-সঙ্গহো", "বুদ্ধ-ৰন্দনা গন্থ-সঙ্গহো", "ৰংস-গন্থ-সঙ্গহো", "ব্যাকরণ গন্থ-সঙ্গহো", "নীতি-গন্থ-সঙ্গহো", "পকিণ্ণক-গন্থ-সঙ্গহো", "সিহল়-গন্থ-সঙ্গহো" ]

function pitakaadd( Index, classid) {
    var x = document.querySelectorAll(`${Index}`);
    for(var i = 0; i < x.length; i++){
      for(var j = 0; j < pitaka.length; j++){
        x[i].outerHTML = `<div class='pitakaName' onclick='booklabelopen(event, "${classid}")'>${pitaka[i]} </div>`
        i++
      }
    }
  }
pitakaadd('.index0', 'mulvi')


